Ci4/app/Controllers/Register.php

    public function register()
    {
        helper (['form']);
        $rules = [
            'email'     => ['label' => 'Email', 'rules'    => 'required|min_length[4]|max_length[255]|valid_email|is_unique[users.email]', 'errors' => [ 'is_unique' => 'Email has been registered!', 'valid_email' => 'Type a valid email!'],],
            'username'  => ['label' => 'Username', 'rules' => 'required|min_length[4]', 'errors' => [ 'min_length' => 'Username too short!'],],
            'password1' => ['label' => 'Password', 'rules' => 'required|min_length[4]|max_length[255]', 'errors' => [ 'min_length' => 'Password too short!'],],
            'password2' => ['label' => 'Password', 'rules' => 'required|matches[password1]', 'errors' => [ 'matches' => 'Password doesnt match!'],]
        ];


        if($this->validate($rules)){
            $model = new UserModel();
            $data = [
                'email'    => $this->request->getVar('email'),
                'username' => $this->request->getVar('username'),
                'password' => password_hash($this->request->getVar('password1'), PASSWORD_DEFAULT),
                'images'   => 'images.jpg'
            ];
            $model->save($data);
---
INSERT INTO `users` (`email`, `username`, `password`, `images`, `created_at`, `updated_at`) VALUES ('user@gmail.com', 'user', '$2y$10$BitXC05VwNSToA7GLIBACeJkAl66Y0V4ERDVRCPunQX700Ms3JGM2', 'images.jpg', '2023-03-01 08:23:22', '2023-03-01 08:23:22')